## Cleaning Text Data
1. string Trimming
  - `.str.strip()` : The .str.strip() method is used to remove whitespace from the beginning and end of a string. It's particularly useful when your dataset contains extra spaces that may affect data quality or analysis.

In [1]:
import pandas as pd
example_series = pd.Series([' Horse', 'Horse   ', '   HORSE', 'HORSE  ', 'H@RSE'])
example_series.head()

0       Horse
1    Horse
2       HORSE
3     HORSE
4       H@RSE
dtype: object

In [2]:
example_series=example_series.str.strip()
example_series

0    Horse
1    Horse
2    HORSE
3    HORSE
4    H@RSE
dtype: object

2. Converting Case
- .str.lower()
- .str.upper()

In [3]:
example_series.str.lower()

0    horse
1    horse
2    horse
3    horse
4    h@rse
dtype: object

In [4]:
example_series.str.upper()

0    HORSE
1    HORSE
2    HORSE
3    HORSE
4    H@RSE
dtype: object

3.  Fixing Incorrect Values with the replace() Method

In [8]:
example_series=example_series.str.replace('@', 'O').str.lower()
example_series.head()

0    horse
1    horse
2    horse
3    horse
4    horse
dtype: object

In [9]:
cancelled = pd.read_csv('https://cdn.theaicore.com/content/lessons/b17e0a6b-68db-4a1f-9433-04ab57d6da3a/cancellations.csv')

cancelled.value_counts()

CANCELLED
False        19
0            13
F            13
True          3
1             1
T             1
Name: count, dtype: int64

In [12]:
cancelled.replace({"0": False},inplace=True)
cancelled.value_counts()

CANCELLED
False        19
False        13
F            13
True          3
1             1
T             1
Name: count, dtype: int64

In [13]:
mapping_dictionary = {'0': False, '1': True, 'F': False, 'T': True, 'True': True, 'False': False}
cancelled.replace(mapping_dictionary, inplace=True)
cancelled = cancelled.astype('bool')
cancelled.value_counts()

C:\Users\Thenu\AppData\Local\Temp\ipykernel_11884\153260280.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  cancelled.replace(mapping_dictionary, inplace=True)

CANCELLED
False        45
True          5
Name: count, dtype: int64

### Regular Expression
- use the str.match() method to apply the regex expression

In [20]:
# Creating a sample dataframe
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eva', 'Frank', 'Grace', 'Hank', 'Ivy', 'Jack'],
    'Phone': ['0123456789', '01234 567890', '+441234567890', '0123-456-789', 
              '(0123) 456789', '1234567890', '0123456789a', '01234-567-890', 
              '+44 1234 567890', '01234']
}

phone_df = pd.DataFrame(data)
phone_df.head(10)

      Name            Phone
0    Alice       0123456789
1      Bob     01234 567890
2  Charlie    +441234567890
3    Diana     0123-456-789
4      Eva    (0123) 456789
5    Frank       1234567890
6    Grace      0123456789a
7     Hank    01234-567-890
8      Ivy  +44 1234 567890
9     Jack            01234

In [17]:
import numpy as np # We will need the `nan` constant from the numpy library to apply to missing values

regex_expression = '^(?:(?:\(?(?:0(?:0|11)\)?[\s-]?\(?|\+)44\)?[\s-]?(?:\(?0\)?[\s-]?)?)|(?:\(?0))(?:(?:\d{5}\)?[\s-]?\d{4,5})|(?:\d{4}\)?[\s-]?(?:\d{5}|\d{3}[\s-]?\d{3}))|(?:\d{3}\)?[\s-]?\d{3}[\s-]?\d{3,4})|(?:\d{2}\)?[\s-]?\d{4}[\s-]?\d{4}))(?:[\s-]?(?:x|ext\.?|\#)\d{3,4})?$' #Our regular expression to match
phone_df.loc[~phone_df['Phone'].str.match(regex_expression), 'Phone'] = np.nan # For every row  where the Phone column does not match our regular expression, replace the value with NaN
phone_df.head(10)

<>:3: SyntaxWarning: invalid escape sequence '\('
<>:3: SyntaxWarning: invalid escape sequence '\('
C:\Users\Thenu\AppData\Local\Temp\ipykernel_11884\4288262543.py:3: SyntaxWarning: invalid escape sequence '\('
  regex_expression = '^(?:(?:\(?(?:0(?:0|11)\)?[\s-]?\(?|\+)44\)?[\s-]?(?:\(?0\)?[\s-]?)?)|(?:\(?0))(?:(?:\d{5}\)?[\s-]?\d{4,5})|(?:\d{4}\)?[\s-]?(?:\d{5}|\d{3}[\s-]?\d{3}))|(?:\d{3}\)?[\s-]?\d{3}[\s-]?\d{3,4})|(?:\d{2}\)?[\s-]?\d{4}[\s-]?\d{4}))(?:[\s-]?(?:x|ext\.?|\#)\d{3,4})?$' #Our regular expression to match

      Name            Phone
0    Alice       0123456789
1      Bob     01234 567890
2  Charlie    +441234567890
3    Diana     0123-456-789
4      Eva    (0123) 456789
5    Frank              NaN
6    Grace              NaN
7     Hank    01234-567-890
8      Ivy  +44 1234 567890
9     Jack              NaN

In [21]:
phone_df['Phone']=phone_df['Phone'].str.replace("+44","0", regex=False)
phone_df

      Name          Phone
0    Alice     0123456789
1      Bob   01234 567890
2  Charlie    01234567890
3    Diana   0123-456-789
4      Eva  (0123) 456789
5    Frank     1234567890
6    Grace    0123456789a
7     Hank  01234-567-890
8      Ivy  0 1234 567890
9     Jack          01234

In [24]:
phone_df['Phone'] = phone_df['Phone'].replace({r'\+44': '0', r'\(': '', r'\)': '', r'-': '', r' ': ''}, regex=True)
phone_df

      Name        Phone
0    Alice   0123456789
1      Bob  01234567890
2  Charlie  01234567890
3    Diana   0123456789
4      Eva   0123456789
5    Frank   1234567890
6    Grace  0123456789a
7     Hank  01234567890
8      Ivy  01234567890
9     Jack        01234

## Unique values
- unique()
- nunique()

In [25]:
# Creating a sample dataframe with a column of product IDs
data = {'product_ids': ['P001', 'P002', 'P003', 'P001', 'P004', 'P005', 'P003', 'P006', 'P002']}
products_df = pd.DataFrame(data)

# Using `unique` to get unique product IDs
unique_ids = products_df['product_ids'].unique()

# Using `nunique` to get the number of unique product IDs
num_unique_ids = products_df['product_ids'].nunique()

# Displaying the original DataFrame
print("Original dataframe:")
print(products_df)

# Displaying the unique product IDs
print("\nUnique product IDs:")
print(unique_ids)

# Displaying the number of unique product IDs and the total number of rows in the DataFrame
print("\nNumber of unique product IDs:")
print(num_unique_ids)


print("\nTotal number of rows in the dataframe:")
print(len(products_df))

Original dataframe:
  product_ids
0        P001
1        P002
2        P003
3        P001
4        P004
5        P005
6        P003
7        P006
8        P002

Unique product IDs:
['P001' 'P002' 'P003' 'P004' 'P005' 'P006']

Number of unique product IDs:
6

Total number of rows in the dataframe:
9

### Handling duplicates
- duplicated()
- drop_duplicates()

In [26]:
# Creating a sample dataframe
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Eva', 'Charlie'],
    'Age': [28, 34, 45, 28, 23, 45],
    'Phone': ['123-456', '456-789', '789-012', '123-456', '345-678', '789-012'],
    'Email': ['alice@email.com', 'bob@email.com', 'charlie@email.com', 
              'alice@email.com', 'eva@email.com', 'charlie@email.com']
}
duplicate_df = pd.DataFrame(data)
duplicate_df

      Name  Age    Phone              Email
0    Alice   28  123-456    alice@email.com
1      Bob   34  456-789      bob@email.com
2  Charlie   45  789-012  charlie@email.com
3    Alice   28  123-456    alice@email.com
4      Eva   23  345-678      eva@email.com
5  Charlie   45  789-012  charlie@email.com

In [27]:
duplicate_df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [28]:
duplicate_df.drop_duplicates()

      Name  Age    Phone              Email
0    Alice   28  123-456    alice@email.com
1      Bob   34  456-789      bob@email.com
2  Charlie   45  789-012  charlie@email.com
4      Eva   23  345-678      eva@email.com

### handling Fuzzy dupplicates

In [29]:
data = {
    'First_Name': ['Alice', 'Alice', 'Alice',  'Alice'],
    'Last_Name': ['Smith', 'Smith', 'Smith', 'Smith'],
    'Age': [28, 34, 45, 45],
    'Phone': ['123-456', '456-789', '123-456', '123-456'],
    'Email': ['alice@email.com', 'alice@smith.com', 
              'alice@theinternet.com',  'Alice@theinternet.com']
}

fuzzy_duplicates_df = pd.DataFrame(data)
fuzzy_duplicates_df

  First_Name Last_Name  Age    Phone                  Email
0      Alice     Smith   28  123-456        alice@email.com
1      Alice     Smith   34  456-789        alice@smith.com
2      Alice     Smith   45  123-456  alice@theinternet.com
3      Alice     Smith   45  123-456  Alice@theinternet.com

### Using GroupBy to Handle Duplicates

In [30]:
# Sample review data
data = {
    'CustomerID': ['C01', 'C01', 'C02', 'C02', 'C03'],
    'ProductID': [101, 101, 102, 102, 103],
    'ReviewScore': [4, 5, 3, 3, 4],
    'CustomerEmail': ['customer1@email.com', 'customer1@domain.com', 'customer2@email.com', 'customer2@domain.com', 'customer3@email.com']
}
reviews_df = pd.DataFrame(data)

# Grouping by CustomerID and ProductID, then taking the highest review score
aggregated_reviews = reviews_df.groupby(['CustomerID', 'ProductID']).agg({'ReviewScore': 'mean'})

aggregated_reviews

                      ReviewScore
CustomerID ProductID
C01        101                4.5
C02        102                3.0
C03        103                4.0

### agg function

In [31]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=["A", "B"])

print("Original dataframe:")
print(df)
# Applying a single aggregate function
result = df.agg('sum')
print("\nResult of using the `agg` function with `sum`:")
result

Original dataframe:
   A  B
0  1  2
1  3  4

Result of using the `agg` function with `sum`:

A    4
B    6
dtype: int64

In [32]:
# Creating a sample dataframe
data = {
    'Customer Name': ['Amina', 'Bahru', 'Charlie', 'Dion', 'Ebo', 'Frank', 'Giana'],
    'Postal Region': ['UK', 'England', 'Wales', 'Cymru', 'Scotland', 'USA', 'Canada']
}
df = pd.DataFrame(data)

# Displaying the original dataframe
print("Original dataframe:")
print(df)

Original dataframe:
  Customer Name Postal Region
0         Amina            UK
1         Bahru       England
2       Charlie         Wales
3          Dion         Cymru
4           Ebo      Scotland
5         Frank           USA
6         Giana        Canada

In [33]:
# Creating a mapping dictionary to unify the country names
country_mapping = {
    'UK': 'United Kingdom',
    'England': 'United Kingdom',
    'Wales': 'United Kingdom',
    'Cymru': 'United Kingdom',
    'Scotland': 'United Kingdom'
}

# Replacing the country names in the 'Postal Country' column
df['Postal Region'] = df['Postal Region'].replace(country_mapping)

# Displaying the DataFrame after cleaning the 'Postal Country' column
print("\nDataFrame After Cleaning 'Postal Country' Column:")
print(df)

DataFrame After Cleaning 'Postal Country' Column:
  Customer Name   Postal Region
0         Amina  United Kingdom
1         Bahru  United Kingdom
2       Charlie  United Kingdom
3          Dion  United Kingdom
4           Ebo  United Kingdom
5         Frank             USA
6         Giana          Canada

### Creating Categorical Columns from Continuous Data

In [34]:

# Creating a sample dataframe
data = {
    'Route': ['NYC-LON', 'LON-PAR', 'NYC-TOK', 'LON-SYD', 'PAR-BER'],
    'Distance': [3461, 214, 6749, 10562, 546]
}
flights = pd.DataFrame(data)

# Displaying the original dataframe
print("Original dataframe:")
print(flights)

# Defining the bin edges and labels
bin_edges = [0, 1500, 4000, 12000]  # in miles
bin_labels = ['short haul', 'medium haul', 'long haul']

# Creating a new categorical column 'Flight Type' by binning the 'Distance' column
flights['Flight Type'] = pd.cut(flights['Distance'], bins=bin_edges, labels=bin_labels, right=False)

# Displaying the dataframe with the new 'Flight Type' column
print("\ndataframe with 'Flight Type' Column:")
print(flights)

Original dataframe:
     Route  Distance
0  NYC-LON      3461
1  LON-PAR       214
2  NYC-TOK      6749
3  LON-SYD     10562
4  PAR-BER       546

dataframe with 'Flight Type' Column:
     Route  Distance  Flight Type
0  NYC-LON      3461  medium haul
1  LON-PAR       214   short haul
2  NYC-TOK      6749    long haul
3  LON-SYD     10562    long haul
4  PAR-BER       546   short haul